---
kind: method
id: M:Autodesk.Revit.DB.TextNoteOptions.#ctor
source: html/bfde4a31-9715-ba37-b9d4-627a166bbc03.htm
---
# Autodesk.Revit.DB.TextNoteOptions.#ctor Method

Default constructor; populates the options with their respective default values.

## Syntax (C#)
```csharp
public TextNoteOptions()
```

## Remarks
The constructed options need to be given a typeId before it can be used to create a text note.